{
  "username": "surrealsavant",
  "profile_url": "https://x.com/surrealsavant",
  "scraped_at": "2026-01-17T22:44:47.041670",
  "filter_terms": [
    "@PalantirTech",
    "jordan",
    "mikhaila",
    "palantir",
    "ben shapiro"
  ],
  "post_count": 87,
  "posts": [
    {
      "text": "I didn’t think Elon was that paranoid. He proved me wrong by being more paranoid than I thought he was capable of and he will lose. Jordan Peterson made an irrational paranoid move and didn’t have to do it. Why do they choose to believe their own paranoia? Where do we go from",
      "timestamp": "2026-01-17T03:29:01.000Z",
      "url": "https://x.com/surrealsavant/status/2012366521872351617"
    },
    {
      "text": "Anders Breivik’s pal, Elon Musk@jordanbpeterson@PalantirTechMaybe the real explanation is that republicans are bad at what they do aside from being a political militia who can get their guy elected to do what he wants. It has its limitations, however.",
      "timestamp": "2026-01-17T00:01:46.000Z",
      "url": "https://x.com/surrealsavant/status/2012314364678648129"
    },
    {
      "text": "Jordan Peterson quit his podcast like he’s the wife of me and@PalantirTech",
      "timestamp": "2026-01-16T07:05:42.000Z",
      "url": "https://x.com/surrealsavant/status/2012058663545160026"
    },
    {
      "text": "Jordan Peterson quit his podcast because he's so afraid of Palantir. But it gave him away. Peterson Academy is what he should have taken down. \nHe has pretended for years that the Left is coming for his 'speech'. So, he put it on the chopping block, like an offering to gods that",
      "timestamp": "2026-01-15T23:26:46.000Z",
      "url": "https://x.com/surrealsavant/status/2011943168112279679"
    },
    {
      "text": "Yes, he is actually against the 1st Amendment.@PalantirTechDr. Karp, we need to talk about Elon Musk.",
      "timestamp": "2026-01-15T12:36:00.000Z",
      "url": "https://x.com/surrealsavant/status/2011779398530220096"
    },
    {
      "text": "They still wouldn't catch Jordan Peterson plagiarizing a Nazi terrorist, and I did@PalantirTech",
      "timestamp": "2026-01-13T09:59:36.000Z",
      "url": "https://x.com/surrealsavant/status/2011015265740337578"
    },
    {
      "text": "More than you can handle, apparently. Hi, I’m the person who scared you off your podcast.@jordanbpeterson",
      "timestamp": "2026-01-13T08:21:58.000Z",
      "url": "https://x.com/surrealsavant/status/2010990692470796626"
    },
    {
      "text": "I still believe my friends. But what am I supposed to do if someone doesn’t believe me and claims we were harmed by the same person and they abuse me for trying to tell them or talk about it? Meet my sister, the female psychopath. It’s verifiably not me,@jordanbpetersonSo, I",
      "timestamp": "2026-01-13T08:29:07.000Z",
      "url": "https://x.com/surrealsavant/status/2010992492603199629"
    },
    {
      "text": "Prove your father told the truth about Osiris and Horus,@MikhailaFuller- prove what he claimed had even a single source to support it. \n\nHe made it up. He in fact, lied his way through a 500 page book. \n\nYou were bamboozled (but you're a very stupid girl who thinks \"emotional",
      "timestamp": "2026-01-11T21:26:08.000Z",
      "url": "https://x.com/surrealsavant/status/2010463259652927958"
    },
    {
      "text": "Leftist with a past has caught Jordan@jordanbpetersonand I’m not worse than the KKK. Is@PalantirTechworse than the KKK? If you catch one of these Culture War mofos for fraud they think you’re the bloody KKK.",
      "timestamp": "2026-01-10T21:54:51.000Z",
      "url": "https://x.com/surrealsavant/status/2010108100804833375"
    },
    {
      "text": "You just wanted all the tribalism for yourself,@jordanbpeterson- you know, to avoid the pitfalls of fascism - not the good parts - just the part that doesn’t revolve around you as a heroic individual - so give you command of it and there’s no problem on your end, amirite,",
      "timestamp": "2026-01-10T00:02:42.000Z",
      "url": "https://x.com/surrealsavant/status/2009777887030006200"
    },
    {
      "text": "Distracted from distraction by distraction - may well be the personalized form of God in the 20th century.  \n\nMichael Sugrue discusses so many things Jordan Peterson plagiarized.",
      "timestamp": "2026-01-09T07:26:40.000Z",
      "url": "https://x.com/surrealsavant/status/2009527227336307017"
    },
    {
      "text": "Ontology or the Logos of Being was revivified by Heidegger. Does Maps of Meaning cite him at all?\n\nNOPE!@PalantirTech@jordanbpeterson- you didn't do your homework, Alex did. He's the new voice for House Judiciary and you're busted. You are my experiment.",
      "timestamp": "2026-01-09T07:17:08.000Z",
      "url": "https://x.com/surrealsavant/status/2009524826210443689"
    },
    {
      "text": "I severed Jordan Peterson. When the head of a terrorist org is taken out it’s called a “beheading” in counterterrorism. He’s the president of the Culture War and Ben Shapiro is its failed lawyer.",
      "timestamp": "2026-01-08T05:14:24.000Z",
      "url": "https://x.com/surrealsavant/status/2009131550185824645"
    },
    {
      "text": "The House Judiciary Committee trusted@jordanbpetersonas an expert on China and he lied about yin-yang at Harvard and in Maps of Meaning. Let’s talk about that and The Palantir Effect. Guys, why did Jordan really quit? Let’s be honest, it’s because I’m not the one with an",
      "timestamp": "2026-01-07T01:42:58.000Z",
      "url": "https://x.com/surrealsavant/status/2008715954767958219"
    },
    {
      "text": "What are we doing with Jordan next? \nWe need Karp to write Jim Jordan a letter. I’ll still do the committee date to reveal Jordan Peterson was effectively stopped out of his fear of retaliation and subjugation by Palantir. I’m just in Richmond, Va - a morning ride to DC. I’ll be",
      "timestamp": "2026-01-07T02:15:17.000Z",
      "url": "https://x.com/surrealsavant/status/2008724089314168952"
    },
    {
      "text": "Steph told Dan Crenshaw why Jordan Peterson appears to be suffering from “mold death”. Dan is on the House Intelligence Committee Permanent and he’s going to be implicated in a RICO because Peterson Academy was started by a guy who this account confronted about having plagiarized",
      "timestamp": "2026-01-05T21:05:33.000Z",
      "url": "https://x.com/surrealsavant/status/2008283754691760532"
    },
    {
      "text": "The disease of stupidity is what Jordan spread throughout the land. A pestilence. A pox. His heros hate the antidote.",
      "timestamp": "2026-01-01T21:34:53.000Z",
      "url": "https://x.com/surrealsavant/status/2006841581874417847"
    },
    {
      "text": "The Waziry Papyrus has Osiris as the God of Death. Not Jordan Peterson’s Harvard bullshit about regeneration of the state. Horus was not the living pharaoh. He was the son of who dead pharaoh is. In the oldest version other than Waziry there’s no state for Horus among the living.",
      "timestamp": "2026-01-01T06:48:17.000Z",
      "url": "https://x.com/surrealsavant/status/2006618462508957923"
    },
    {
      "text": "Jordan Peterson is a fraud.@PalantirTech",
      "timestamp": "2025-12-31T20:58:34.000Z",
      "url": "https://x.com/surrealsavant/status/2006470055266234526"
    },
    {
      "text": "Progress for STEM is feminism. I constrained mental rotation better than Shepard & Metzler. There’s my kind and the other kind. Give me access to the NSF.@PalantirTechJordan Peterson is a Harvard fraud. Tell DNI Gabbard. RICO the Peterson Academy. Happy holidays!",
      "timestamp": "2025-12-28T22:16:29.000Z",
      "url": "https://x.com/surrealsavant/status/2005402499868717389"
    },
    {
      "text": "There has to be oversight and it probably is going to come from@PalantirTech- I'll even go there to do it if that's what it takes. I will audit the model I invalidated in cognitive science there if they hire me. For the record I believe Alex Karp pulled leverage and got the",
      "timestamp": "2025-12-23T09:46:14.000Z",
      "url": "https://x.com/surrealsavant/status/2003401756982566970"
    },
    {
      "text": "A god complex is what he has@MikhailaFuller@jordanbpeterson",
      "timestamp": "2025-12-13T21:02:52.000Z",
      "url": "https://x.com/surrealsavant/status/1999948158722588837"
    },
    {
      "text": "Jordan Peterson got away with influencing more people than the number getting away with fraud in the welfare system. He has this buffoon eating out of his hand. There'a whole interview of them lying back and forth.",
      "timestamp": "2025-12-21T20:14:39.000Z",
      "url": "https://x.com/surrealsavant/status/2002835124346614266"
    },
    {
      "text": "Jordan Peterson lied about Osiris and Isis to the point of it being fraudulent and Maps of Meaning is so infested with typographical errors that someone should have been fired at Routledge for publishing it. I don't typically think Routledge books are impressive (as a scientist)",
      "timestamp": "2025-12-21T20:07:20.000Z",
      "url": "https://x.com/surrealsavant/status/2002833285571809674"
    },
    {
      "text": "I am auditing Harvard Psychology.@palantir@vice@jordanbpeterson",
      "timestamp": "2025-12-21T19:44:38.000Z",
      "url": "https://x.com/surrealsavant/status/2002827572548374708"
    },
    {
      "text": "Jordan Peterson pretended Isis got herself pregnant with Osiris's dismembered phallus. \nPlutarch's compiled version (with references) of the the legend of Osiris (Isis and Osiris) says the phallus was the only piece of Osiris Isis didn't find. And the battle between Set (Typhon)",
      "timestamp": "2025-12-21T04:32:07.000Z",
      "url": "https://x.com/surrealsavant/status/2002597931090592029"
    },
    {
      "text": "Jordan Peterson just keeps lying about Osiris and you just keep letting him do it. Don’t you?",
      "timestamp": "2025-12-20T22:40:10.000Z",
      "url": "https://x.com/surrealsavant/status/2002509356747907206"
    },
    {
      "text": "I understand that Palantir does public records seek and destroy searches for ICE and gets people with various software techniques, e.g. Computational Vision; character and facial recognition, court docs, etc. Conservatives wanted to purge the system. \n\nDon’t you think it’s better",
      "timestamp": "2025-12-18T21:11:10.000Z",
      "url": "https://x.com/surrealsavant/status/2001762185136025811"
    },
    {
      "text": "Brought down Jordan Peterson with less than 400 followers. Blocked by his whole family and also kicked out of Hasan Piker’s whole community. I don’t need you.",
      "timestamp": "2025-12-18T19:51:19.000Z",
      "url": "https://x.com/surrealsavant/status/2001742088418005135"
    },
    {
      "text": "This guy platforms Jordan Peterson who copied a Nazi and also has a US Representative doing RICO violations.",
      "timestamp": "2025-12-18T00:40:34.000Z",
      "url": "https://x.com/surrealsavant/status/2001452492719059051"
    },
    {
      "text": "I am better at mental rotation than every white male cognitive scientist on earth and that's in performance of tasks and of research, model correction, as well as constraining it. I have invalidated a model used for longer than I've been alive.\n\nI also caught Jordan Peterson's",
      "timestamp": "2025-12-17T22:17:29.000Z",
      "url": "https://x.com/surrealsavant/status/2001416486070489505"
    },
    {
      "text": "Jordan Peterson and Nazi Anders Breivik both blame feminism for the \"impending collapse\" of Western civilization and they are both paranoid. Colin is paranoid because he is wrong just like his friends the Nazi and the con man.",
      "timestamp": "2025-12-17T19:56:54.000Z",
      "url": "https://x.com/surrealsavant/status/2001381105841377344"
    },
    {
      "text": "No, it's not happening. White able bodied men are doing fraud and getting away with it. And they are letting each other get away with it. Jordan Peterson is a con man. Elon is feeling sorry for an absolute turd of a pseudoscientist.",
      "timestamp": "2025-12-17T19:51:12.000Z",
      "url": "https://x.com/surrealsavant/status/2001379673281057201"
    },
    {
      "text": "Colin, Jordan Peterson is the able bodied white male who is the biggest most book selling fraud Harvard has every produced and your crime boss, Ben Shapiro has been absolutely wrecked by him - and he also copied a Nazi's terrorist manifesto - but here you are complaining about a",
      "timestamp": "2025-12-17T19:45:04.000Z",
      "url": "https://x.com/surrealsavant/status/2001378127910703614"
    },
    {
      "text": "Serial plagiarist? Jordan Peterson is a pathological liar who got away with fraud at Harvard and made a religion out of his delusion of a framework for pretend play that he conned people into believing was valid. It wasn't. He lied. Profusely to his students. Then he scapegoated",
      "timestamp": "2025-12-14T04:16:08.000Z",
      "url": "https://x.com/surrealsavant/status/2000057193714864533"
    },
    {
      "text": "The conspiracy theories of@jordanbpetersonand Anders Breivik, who is a dedicated and open Nazi in prison for being the most lethal solo acting terrorist we know of, are strikingly similar. \n\nThis suggests narcissism. Full stop.@MikhailaFuller",
      "timestamp": "2025-12-13T23:52:51.000Z",
      "url": "https://x.com/surrealsavant/status/1999990936210903104"
    },
    {
      "text": "I compared Jordan Peterson's PragerU video, \"Who Is Teaching Your Kids?\" to a Nazi's manifesto. The results are shocking yet not surprising. \n\nThey both hate feminism in universities. \nThey are both paranoid about war breaking out (metaphorical Hobbes' Leviathan and Breivik's",
      "timestamp": "2025-12-13T23:20:13.000Z",
      "url": "https://x.com/surrealsavant/status/1999982720143781970"
    },
    {
      "text": "I analyzed Jordan Peterson's PragerU video against Anders Breivik's manifesto and did data analysis - misogyny against feminism is what they have exactly in common. They lie about it and blame it for the collapse of society.https://github.com/savantlab/nlp-counterterrorism-peterson…",
      "timestamp": "2025-12-13T20:43:16.000Z",
      "url": "https://x.com/surrealsavant/status/1999943224639840540"
    },
    {
      "text": "Post MCP GitHub repo for natural language processing analysis of Anders Breivik vs Jordan Peterson via PragerUhttps://github.com/savantlab/nlp-counterterrorism-peterson?tab=readme-ov-file…They are \"critiquing the same framework\" and there's a pattern.",
      "timestamp": "2025-12-13T01:14:22.000Z",
      "url": "https://x.com/surrealsavant/status/1999649062652682308"
    },
    {
      "text": "Grok and all the LLMs are lying for@jordanpetersonJordan Peterson even when they disagree with Jordan Peterson and basically catch him, Jordan Peterson, lying - \n\n\"\nin his 2016–2017 lectures (available on YouTube), he describes the pharaoh as embodying both Osiris",
      "timestamp": "2025-12-12T01:50:01.000Z",
      "url": "https://x.com/surrealsavant/status/1999295643894870481"
    },
    {
      "text": "\"The live pharaoh is simultaneously Osiris and Horus\" - Dr. Jordan Peterson, 1996 \nBut Osiris never meant the live pharaoh in any capacity to the Egyptians, Jordan. You skipped the actual story and pretended a \"believed myth\", a lie, but not just one. Many.@jordanbpeterson",
      "timestamp": "2025-12-12T00:21:28.000Z",
      "url": "https://x.com/surrealsavant/status/1999273362237837676"
    },
    {
      "text": "Why does Jordan Peterson tell people they are basically Christians if they are Westerners? Let’s find out in Maps of Meaning and remind ourselves that he’s a fraud.@sapinker@PalantirTech",
      "timestamp": "2025-12-11T03:33:48.000Z",
      "url": "https://x.com/surrealsavant/status/1998959373281063206"
    },
    {
      "text": "Jordan got away with fraud at Harvard - I’m reading a page of my book, The Depth of Deception - Jordan Peterson’s Fraud Story",
      "timestamp": "2025-12-10T21:34:01.000Z",
      "url": "https://x.com/surrealsavant/status/1998868830689570847"
    },
    {
      "text": "You work for a fraud at a fake university who was never qualified and got away with fraud - you clearly have taken no time with Maps of Meaning or anything to do with it - see@jordanbpetersonHarvard lectures - for the lies that cannot withstand a basic encyclopedic reference",
      "timestamp": "2025-12-09T22:49:26.000Z",
      "url": "https://x.com/surrealsavant/status/1998525425417425198"
    },
    {
      "text": "He’s one of the most incompetent people in San Francisco tonight - letting Jordan do fraud in plain sight in front of an AI tech based crowd",
      "timestamp": "2025-12-09T22:43:44.000Z",
      "url": "https://x.com/surrealsavant/status/1998523990969852227"
    },
    {
      "text": "He’s been fooling the whole meritocracy \nWe need to talk about@jordanbpeterson@PalantirTech",
      "timestamp": "2025-12-09T22:30:01.000Z",
      "url": "https://x.com/surrealsavant/status/1998520538357182528"
    },
    {
      "text": "For the woman who knows her Power@MikhailaFuller@jordanbpeterson",
      "timestamp": "2025-12-07T02:34:46.000Z",
      "url": "https://x.com/surrealsavant/status/1997494968035021141"
    },
    {
      "text": "“Fantasy can be used to create the real world, as well as the world of illusion. It all depends on who is doing the imagining, and to what end.” - Dr. Jordan B. Peterson\n\nHe pretended for himself.",
      "timestamp": "2025-12-07T23:33:22.000Z",
      "url": "https://x.com/surrealsavant/status/1997811705796342244"
    },
    {
      "text": "Guys, yes, Elon quoted this same one, but omg I think we need to talk about sentencing women for calling a gang rapist a 'disgusting pig' - I personally like talking a lot of shit@PalantirTech",
      "timestamp": "2025-12-07T21:37:09.000Z",
      "url": "https://x.com/surrealsavant/status/1997782459065287027"
    },
    {
      "text": "It’s a ritual of power, Jordan’s magical thinking.",
      "timestamp": "2025-12-06T21:43:06.000Z",
      "url": "https://x.com/surrealsavant/status/1997421566649307357"
    },
    {
      "text": "Where is the logic gate to the meritocracy?@PalantirTechI’ve caught Jordan Peterson’s fraud at Harvard and resolved a paradoxical model in cognitive science and I want my lanyard.",
      "timestamp": "2025-12-05T23:33:15.000Z",
      "url": "https://x.com/surrealsavant/status/1997086899333177369"
    },
    {
      "text": "Good morning, Jordan Peterson.",
      "timestamp": "2025-12-05T12:15:00.000Z",
      "url": "https://x.com/surrealsavant/status/1996916211804688647"
    },
    {
      "text": "Logged out view of feed and posts are out of order starting with Jun 29 then Oct 14 - not sure if that's intentional.@PalantirTech@nikitabier",
      "timestamp": "2025-12-05T02:37:36.000Z",
      "url": "https://x.com/surrealsavant/status/1996770903984951501"
    },
    {
      "text": "“But error is the mother of all things.” \n- Jordan B. Peterson, Maps of Meaning",
      "timestamp": "2025-12-05T02:03:41.000Z",
      "url": "https://x.com/surrealsavant/status/1996762370169868558"
    },
    {
      "text": "Jordan Peterson changed a story that lasted for 4000 years in Egypt and called it “irrelevant”. He feigned meaning of one of the most well documented symbols in ancient Egyptian culture. \n\nThe Egyptians were kind of all over the place as far as a few things; heaven, earth, and",
      "timestamp": "2025-12-05T00:56:21.000Z",
      "url": "https://x.com/surrealsavant/status/1996745424787358099"
    },
    {
      "text": "Look at the hieroglyphics for a “change”. \n\nJordan Peterson created a “myth”, another meaning of ‘lie’ by completely ignoring the real symbolism of Osiris as the soul and instead pretended he was a hero symbolically.@PalantirTech",
      "timestamp": "2025-12-05T00:05:06.000Z",
      "url": "https://x.com/surrealsavant/status/1996732525478326775"
    },
    {
      "text": "Jordan Peterson is caught, but how caught is he?  Don’t drink his addicting Kool-Aid, Alex. \nI won’t even respect you.  And I don’t respect Elon Musk. Stop pretending.@PalantirTechI’m Steph, \n\nI expose Jordan Peterson’s fraud in Maps Of Meaning beyond the Order of his",
      "timestamp": "2025-12-03T22:57:53.000Z",
      "url": "https://x.com/surrealsavant/status/1996353224450658598"
    },
    {
      "text": "What do Steven Pinker and Jordan Peterson both do? \n\nWatch. Be amazed.",
      "timestamp": "2025-12-02T19:24:44.000Z",
      "url": "https://x.com/surrealsavant/status/1995937194369028525"
    },
    {
      "text": "Good morning, Jordan Peterson.",
      "timestamp": "2025-12-02T11:01:00.000Z",
      "url": "https://x.com/surrealsavant/status/1995810425343005060"
    },
    {
      "text": "Let’s do more research about Osiris in The Egyptian Book Of The Dead so we can prove Maps of Meaning is in fact fraudulent - which I have done and continue to do@MikhailaFuller@jordanbpeterson@benshapiro",
      "timestamp": "2025-12-01T20:18:29.000Z",
      "url": "https://x.com/surrealsavant/status/1995588333934985607"
    },
    {
      "text": "How is Jordan Peterson’s fake account of Osiris’ meaning better and more merit worthy than The Egyptian Book of the Dead? \n\nWhat is the reason for an alternate account?@jordanbpeterson@MikhailaFuller",
      "timestamp": "2025-11-30T23:10:46.000Z",
      "url": "https://x.com/surrealsavant/status/1995269301813543331"
    },
    {
      "text": "Who gets Mikhaila deported for doing a RICO violation?@PalantirTech",
      "timestamp": "2025-11-30T20:55:32.000Z",
      "url": "https://x.com/surrealsavant/status/1995235267163361606"
    },
    {
      "text": "Mass deception isn't sexy,@jordanbpeterson@MikhailaFuller",
      "timestamp": "2025-11-30T20:11:32.000Z",
      "url": "https://x.com/surrealsavant/status/1995224195282940231"
    },
    {
      "text": "God is like the proposition of the 'realm of uselessness' and 2+2 is more than a proposition - paradoxically useless male alert incoming via Ben Shapiro and Jordan Peterson",
      "timestamp": "2025-11-30T18:24:28.000Z",
      "url": "https://x.com/surrealsavant/status/1995197251166318728"
    },
    {
      "text": "He can't stop pretending for himself@PalantirTech",
      "timestamp": "2025-11-30T18:07:34.000Z",
      "url": "https://x.com/surrealsavant/status/1995192998846742780"
    },
    {
      "text": "I have as many mortifying typos as Maps of Meaning@jordanbpetersonprinted by Routledge",
      "timestamp": "2025-11-28T17:58:58.000Z",
      "url": "https://x.com/surrealsavant/status/1994466059827519660"
    },
    {
      "text": "I need to talk to Dr. Karp@PalantirTech- this is about Jordan Peterson, of course",
      "timestamp": "2025-11-28T17:53:44.000Z",
      "url": "https://x.com/surrealsavant/status/1994464740228116591"
    },
    {
      "text": "So, Peter doesn’t know Jordan did fraud and I caught him. He has some useful insights about self sacrifice being a dead end for young conservative men. And then he concludes with a character judgment about Jordan which he really didn’t have information to make. I mean… omg",
      "timestamp": "2025-11-28T00:31:27.000Z",
      "url": "https://x.com/surrealsavant/status/1994202442892759295"
    },
    {
      "text": "Grok would say there’s “no evidence” that Jordan Peterson lied about Osiris at Harvard - there is in fact proof and he has had it up on his channel for over a decade as well as in Maps of Meaning (1999). Women are really tired of catching men pretend for each other with AI",
      "timestamp": "2025-11-27T20:05:05.000Z",
      "url": "https://x.com/surrealsavant/status/1994135409480118464"
    },
    {
      "text": "This is the place to \"lecture\" men about ->\n\n1. Jordan Peterson doing fraud at Harvard and getting away with it\n\n2. Male inferiority at mental rotation tasks in cognitive science \n\n3. Male propensity to mass atrocity and blaming women for half of whatever men decide to do\n\n4.",
      "timestamp": "2025-11-25T16:48:27.000Z",
      "url": "https://x.com/surrealsavant/status/1993361148897313057"
    },
    {
      "text": "hahahahahaaaa omg I wouldn't even subject MAGA to Steven's idiotic bullshit pseudoscience - he has no ethics - notice how he can't even correct his own errors as a shitty Scientist who failed to contribute - he'll keep pretending for at least one man - himself - but also Jordan",
      "timestamp": "2025-11-25T16:26:25.000Z",
      "url": "https://x.com/surrealsavant/status/1993355605516427712"
    },
    {
      "text": "To answer Brian -@MikhailaFullerdoes deserve to be blamed and punished for her father’s fraud at Harvard because she is using it for her own benefit to do the same fraudulent crime with it which she should get RICO’d for - punishing her for using it in her business isn’t the",
      "timestamp": "2025-11-22T00:17:18.000Z",
      "url": "https://x.com/surrealsavant/status/1992024556240785492"
    },
    {
      "text": "I’m currently looking for people who feel harmed by Jordan Peterson as clients or as students and who weren’t aware he did fraud at Harvard. Let’s aggregate some folks who shouldn’t have paid him including Peterson Academy students.",
      "timestamp": "2025-11-18T18:10:35.000Z",
      "url": "https://x.com/surrealsavant/status/1990845102437110033"
    },
    {
      "text": "Ditch Licker is my new favorite thing to call Alex Karp@PalantirTech",
      "timestamp": "2025-11-18T18:08:40.000Z",
      "url": "https://x.com/surrealsavant/status/1990844621207835034"
    },
    {
      "text": "Here’s the thing, Alex - can you be the person who admits they are wrong about male supremacy?@PalantirTechAnd progressives don’t have to admit anything \n\nAnd they don’t have to like you \n\nAnd they can be right about men \n\nAnd people can dislike Trump \n\nAnd people can",
      "timestamp": "2025-11-14T23:26:35.000Z",
      "url": "https://x.com/surrealsavant/status/1989475074705875393"
    },
    {
      "text": "Do men deserve better than me?@PalantirTech",
      "timestamp": "2025-11-14T19:41:18.000Z",
      "url": "https://x.com/surrealsavant/status/1989418381540519992"
    },
    {
      "text": "Academics flubbed decades worth of cognitive science to try to prove men were more valuable to STEM and Alex Karp can help me do STEM parity@PalantirTech",
      "timestamp": "2025-11-12T18:45:01.000Z",
      "url": "https://x.com/surrealsavant/status/1988679443322400872"
    },
    {
      "text": "I’m not defending Alex but how does he go from he doesn’t stand for Palestinians losing innocent lives to Israel is the most precise with his software? Can I talk to you, Alex?@PalantirTechAlex has said he didn’t support the genocide \nSo, what is he not saying? \nHe’s unhappy",
      "timestamp": "2025-11-11T19:11:14.000Z",
      "url": "https://x.com/surrealsavant/status/1988323652153278871"
    },
    {
      "text": "Talkin’ about the big boys and the hand gesture prompt killed the audio sync@nikitabier@PalantirTech- stop the atrocity on X - now, goddamnit",
      "timestamp": "2025-11-10T22:41:50.000Z",
      "url": "https://x.com/surrealsavant/status/1988014261361406151"
    },
    {
      "text": "The feds don’t have to tolerate fraud@MikhailaFullerCooperate and defect on your father - who has you doing mass deception and you know you haven’t done the work - he has you pretending tolerating his fraud is the best you can do - by pretending it’s not real and you didn’t",
      "timestamp": "2025-11-09T16:48:40.000Z",
      "url": "https://x.com/surrealsavant/status/1987562999242977287"
    },
    {
      "text": "Jordan Peterson isn’t calling his fraud what it is - he’s tolerating himself and expecting everyone to tolerate it or else he’ll open the big debate about women and since women won’t like it - he will do it just to be tolerated while being intolerant of women - who he tolerates",
      "timestamp": "2025-11-09T16:45:01.000Z",
      "url": "https://x.com/surrealsavant/status/1987562078064824791"
    },
    {
      "text": "I’m intolerant of Jordan Peterson getting away with fraud at Harvard and I’m intolerant of everyone who let him do it and is still letting him do it - everyone should be fired and/or RICO’d and there should be STEM parity in academia - men want everything to be consequence free",
      "timestamp": "2025-11-09T16:41:29.000Z",
      "url": "https://x.com/surrealsavant/status/1987561189635719215"
    },
    {
      "text": "Oh, Tammy@MikhailaFuller- the best move is to cooperate with the system - for these people",
      "timestamp": "2025-11-08T20:36:34.000Z",
      "url": "https://x.com/surrealsavant/status/1987257963937951881"
    },
    {
      "text": "Should Mikhaila receive the same federal sentence as her father? No, because that’s unfair to women. Men have no proof that they are being discriminated against in federal court. Women play the game better and men should learn to cooperate with the system after they are caught",
      "timestamp": "2025-11-07T18:53:23.000Z",
      "url": "https://x.com/surrealsavant/status/1986869606540321013"
    },
    {
      "text": "Ben Shapiro deserves to be RICO’d and he’s going to blame women equally for his bad decisions@HouseJudiciary- that’s what they have men believing - that fairness is women being owed the blame for what men do but sharing it equally@MikhailaFulleryou should all be ashamed of",
      "timestamp": "2025-11-06T01:01:17.000Z",
      "url": "https://x.com/surrealsavant/status/1986237416995209539"
    },
    {
      "text": "So, first of all the conception requires it and Biology has no agency - it’s not the god king of humans Ben Shapiro wants it to be",
      "timestamp": "2025-11-05T19:48:34.000Z",
      "url": "https://x.com/surrealsavant/status/1986158719210840564"
    }
  ]
}